app/src/main/res/raw/soap_reg_query

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <RegQuery xmlns="http://railway.gtwise.com">
            <sEmail>$email</sEmail>
            <sSerialNumber>$sSerialNumber</sSerialNumber>
            <sAuthInfo>$sAuthInfo</sAuthInfo>
            <sSessionKey>$sSessionKey</sSessionKey>
        </RegQuery>
    </soap:Body>
</soap:Envelope>